In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(columns=['A', 'B', 'C'])
df

Empty DataFrame
Columns: [A, B, C]
Index: []

In [3]:
df.loc[0, 'B'] = 1
df.loc[1] = [1, 2, 3]
df

     A  B    C
0  NaN  1  NaN
1    1  2    3

In [4]:
df1 = pd.DataFrame({'A':['a1', 'a2'], 'B':['b1', 'b2']})
df2 = pd.DataFrame({'B':['b1'], 'C':['c1']})

In [5]:
df1.append(df2)

C:\Users\anton\AppData\Local\Temp\ipykernel_2468\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

     A   B    C
0   a1  b1  NaN
1   a2  b2  NaN
0  NaN  b1   c1

In [6]:
df = pd.DataFrame({"color":['red', 'blue', 'red', 'blue']}, index=[True, False, True, False])
df

      color
True    red
False  blue
True    red
False  blue

In [7]:
df.loc[True]

     color
True   red
True   red

In [8]:
colors = ['red', 'blue', 'red', 'blue']
names = ['rose', 'violet', 'tulip', 'hareball']
size = ['big', 'big', 'small', 'small']

df = pd.DataFrame({"colors": colors, "names": names, "size": size})
df

  colors     names   size
0    red      rose    big
1   blue    violet    big
2    red     tulip  small
3   blue  hareball  small

In [9]:
df[[True, False, True, False]]

  colors  names   size
0    red   rose    big
2    red  tulip  small

In [10]:
df['size'] == 'small'

0    False
1    False
2     True
3     True
Name: size, dtype: bool

In [11]:
size_small_mask = df['size'] == 'small'
df[size_small_mask]

  colors     names   size
2    red     tulip  small
3   blue  hareball  small

In [12]:
df = pd.DataFrame({"color": colors, "size": size})
df.index.name = "name"
df.index = names
df

         color   size
rose       red    big
violet    blue    big
tulip      red  small
hareball  blue  small

In [13]:
rose_mask = df.index == 'rose'
df[rose_mask]

     color size
rose   red  big

In [14]:
s = pd.Series(["a", "b", "c", "a", "c"], dtype="category")
s

0    a
1    b
2    c
3    a
4    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [15]:
df = pd.DataFrame({"A":s})
df["B"] = df["A"].astype('category')
df["C"] = pd.Categorical(df["B"])

df

   A  B  C
0  a  a  a
1  b  b  b
2  c  c  c
3  a  a  a
4  c  c  c

In [16]:
df = pd.DataFrame(np.random.choice(['foo', 'bar', 'baz'], size=(1000, 3)))
df = df.apply(lambda col: col.astype('category'))

df.shape
df

       0    1    2
0    foo  bar  bar
1    foo  bar  bar
2    bar  baz  baz
3    baz  bar  bar
4    foo  bar  baz
..   ...  ...  ...
995  bar  bar  bar
996  bar  bar  foo
997  bar  bar  bar
998  bar  baz  foo
999  baz  baz  baz

[1000 rows x 3 columns]

In [17]:
df = pd.DataFrame(np.random.randn(1000, 3), columns=['a', 'b', 'c'])
df

            a         b         c
0   -0.023038  0.735769  1.960319
1   -0.262029  0.698181 -0.798169
2   -1.184524  0.088646  0.616191
3    1.089350  0.687168  0.004715
4    0.729623  1.538539  0.600222
..        ...       ...       ...
995  1.031967 -0.508450  0.140042
996 -0.396281 -0.263022  0.163714
997 -1.719953 -0.120951  2.214888
998  0.306268  1.721870 -0.914770
999 -0.626125  0.118219  1.329392

[1000 rows x 3 columns]

In [18]:
df.corr()

          a         b         c
a  1.000000  0.027417 -0.054716
b  0.027417  1.000000  0.014171
c -0.054716  0.014171  1.000000

In [19]:
df = pd.DataFrame({'numbers': [1, 2, 3], 'colors': ['red', 'blue', 'white']})
df

   numbers colors
0        1    red
1        2   blue
2        3  white

In [20]:
df = pd.DataFrame(np.random.randn(5, 3), columns=list("ABC"))
df

          A         B         C
0 -0.711976  0.012909  1.017975
1  0.592078 -0.406103  0.920416
2 -0.949086 -2.178396  0.202531
3 -0.947943  0.068714 -1.135517
4  0.353021  0.970013 -1.478849

In [21]:
df = pd.DataFrame(np.arange(15).reshape((5, 3)), columns=list("ABC"))
df

    A   B   C
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [22]:
rng = pd.date_range('2023-01-03', periods=5, freq='T')
df = pd.DataFrame({"Date": rng, "Val": np.random.randn(len(rng))})
df

                 Date       Val
0 2023-01-03 00:00:00  0.073563
1 2023-01-03 00:01:00 -1.316159
2 2023-01-03 00:02:00  0.363727
3 2023-01-03 00:03:00  1.889764
4 2023-01-03 00:04:00  1.090794

In [23]:
rng = pd.date_range(start="2023-01-03", periods=5, freq='D')
df = pd.DataFrame({"Date": rng, "Val": np.random.randn(len(rng))})

df

        Date       Val
0 2023-01-03  0.174138
1 2023-01-04  1.239166
2 2023-01-05  1.144665
3 2023-01-06  0.611513
4 2023-01-07  2.003577

In [24]:
rng = pd.date_range(start="2000-01-01", periods=5, freq='T')
df = pd.DataFrame({"Val": np.random.randn(len(rng))}, index=rng)

df

                          Val
2000-01-01 00:00:00  0.513425
2000-01-01 00:01:00  0.072093
2000-01-01 00:02:00  0.712862
2000-01-01 00:03:00  1.447077
2000-01-01 00:04:00 -0.524485

In [25]:
names = ['John Smith', 'Mary Brown']
gender = ['M', 'F']
smoker = ['Y', 'N']

df = pd.DataFrame({"Names": names, "Gender": gender, "Smoker": smoker})
df

        Names Gender Smoker
0  John Smith      M      Y
1  Mary Brown      F      N

In [26]:
df_with_dummies = pd.get_dummies(df, columns=['Gender', 'Smoker'])
df_with_dummies

        Names  Gender_F  Gender_M  Smoker_N  Smoker_Y
0  John Smith         0         1         0         1
1  Mary Brown         1         0         1         0

In [29]:
df = pd.DataFrame({'A': [1, 2, 2, 4, 1], 'B': [1, 2, 3, 7, 8]})
df

   A  B
0  1  1
1  2  2
2  2  3
3  4  7
4  1  8

In [31]:
df.drop_duplicates(subset=['A'])

   A  B
0  1  1
1  2  2
3  4  7

In [34]:
id_numbers = pd.Series([111, 112, 113, 114, 115, 112, 115, 113])
id_numbers.nunique()
id_numbers.unique()

array([111, 112, 113, 114, 115], dtype=int64)

In [36]:
df = pd.DataFrame({"A": [1, 1, 2, 3, 1], "B": [5, 3, 2, 7, 8]})
df["A"].unique()

array([1, 2, 3], dtype=int64)